Revit 2026 API

# AnalyticalElementSelector Enumeration

---

Specifies a portion of an Analytical Element or the whole element.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AnalyticalElementSelector
```
```vb
Public Enumeration AnalyticalElementSelector
```
```cpp
public enum class AnalyticalElementSelector
```
```fsharp
type AnalyticalElementSelector
```

| Member name | Value | Description |
| --- | --- | --- |
| EndOrTop | 1 | End or top of element (corresponds to end = 1). |
| StartOrBase | 0 | Start or base of element (corresponds to end = 0). |
| Whole | 2 | Entire element |

#### Reference

Autodesk.Revit.DB.Structure Namespace